app/views/confirmations/show.html.erb

    <h1 class="text-3xl font-bold text-green-600 mb-4">Purchase Confirmed!</h1>
    <p class="text-lg mb-4">Congratulations! You've successfully purchased <%= session[:last_purchase_items] || current_user.purchases.sum { |p| p.quantity } %> ticket<%= session[:last_purchase_items].to_i > 1 ? 's' : '' %>.</p>
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."user_id" = 1