app/controllers/carts_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" IN (6, 12)
SELECT COUNT(*) FROM "events" WHERE (date >= '2025-09-18')
SELECT "events".* FROM "events" WHERE "events"."id" = 22 LIMIT 1
---
  def show
    @cart = session[:cart] || {}
    @events = Event.where(id: @cart.keys).map do |event|
      { event: event, quantity: @cart[event.id.to_s] }
    end
    @total = @events.sum { |item| item[:event].price * item[:quantity] }

SELECT "events".* FROM "events" WHERE "events"."id" = 2
SELECT "events".* FROM "events" WHERE "events"."id" IN (19, 18)
UPDATE "events" SET "tickets_available" = 142, "updated_at" = '2025-08-29 13:52:38.584666' WHERE "events"."id" = 2
INSERT INTO "purchases" ("user_id", "event_id", "quantity", "total_price", "purchased_at", "created_at", "updated_at") VALUES (1, 12, 2, 60.0, '2025-08-29 15:24:12.235911', '2025-08-29 15:24:12.317429', '2025-08-29 15:24:12.317429') RETURNING "id"
---
  def purchase
    @cart = session[:cart] || {}
    @events = Event.where(id: @cart.keys).map do |event|
      { event: event, quantity: @cart[event.id.to_s] }
    end
    @total = @events.sum { |item| item[:event].price * item[:quantity] }

    if @cart.any?
      @events.each do |item|
        event = item[:event]
        quantity = item[:quantity]
        if event.tickets_available >= quantity
          event.tickets_available -= quantity
          event.save
          # Create purchase record
          current_user.purchases.create!(
            event: event,
            quantity: quantity,
            total_price: event.price * quantity,
            purchased_at: Time.current
          )