app/controllers/carts_controller.rb

  def add_item
    event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = 22 LIMIT 1