app/controllers/checkouts_controller.rb

  def simulate
    @cart = sanitize_cart(session[:cart] || {})
    if @cart.blank?
      redirect_to cart_path, alert: "Your cart is empty." and return
    end
    @items = Event.where(id: @cart.keys).map do |event|
---
SELECT "events".* FROM "events" WHERE "events"."id" = 839

  def simple
    cart = sanitize_cart(session[:cart] || {})
    if cart.blank?
      redirect_to cart_path, alert: "Your cart is empty." and return
    end

    events = Event.where(id: cart.keys).select(:id, :name, :price)
    if events.empty?
      redirect_to cart_path, alert: "No valid items in cart." and return
    end

    total_qty = 0
    total_paid = 0
    events.each do |ev|
---
SELECT "events"."id", "events"."name", "events"."price" FROM "events" WHERE "events"."id" IN (839, 1032, 1031, 1029, 765, 141)
SELECT 1 AS one FROM "events" WHERE "events"."id" = 83 LIMIT 1
SELECT "events"."id", "events"."name", "events"."price" FROM "events" WHERE "events"."id" = 83

  def create_session
    unless ENV["STRIPE_SECRET_KEY"].present?
      Rails.logger.error("Stripe secret key missing (ENV STRIPE_SECRET_KEY)")
      redirect_to checkout_simulate_path, notice: "Simulation mode: Stripe not configured. Proceed with a simulated payment." and return
    end

    cart = sanitize_cart(session[:cart] || {})
    if cart.blank?
      redirect_to cart_path, alert: "Your cart is empty." and return
    end

    # Only consider items with a positive quantity to reduce work/IO
    payable_ids = cart.select { |_id, q| q.to_i > 0 }.keys
    if payable_ids.empty?
      redirect_to cart_path, alert: "No payable items in cart (invalid quantity)." and return
    end

    # Select only the columns we need for Stripe line items
    items = Event.where(id: payable_ids).select(:id, :name, :price)
    if items.empty?
---
SELECT "events".* FROM "events" WHERE "events"."id" = 839
SELECT 1 AS one FROM "events" WHERE "events"."id" = 839 LIMIT 1