app/controllers/confirmations_controller.rb

  def show
    @purchases = current_user.purchases.order(purchased_at: :desc).limit(5) # Show last 5 purchases
    @total_purchased = @purchases.sum { |p| p.total_price }
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."user_id" = 1 ORDER BY "purchases"."purchased_at" DESC LIMIT 5