app/controllers/events_controller.rb

  def index
    # Public listing: use external API
    begin
      api = EventsApi.new
      events = api.list_events
      # Optional simple query filter on the client if provided
      if params[:query].present?
        q = params[:query].to_s.downcase
        events = events.select do |e|
          [e["name"], e["venue"], e["date"].to_s].compact.any? { |v| v.to_s.downcase.include?(q) }
        end
        # Limit homepage results under a query to keep carousel within bounds
        events = events.first(12)
      end
      # Limit results for homepage only when no query (limit before mapping to reduce work)
      events = events.first(6) if params[:query].blank?
      @events = events.map { |h| ApiEventMapper.from_hash(h) }
---
SELECT "events".* FROM "events" WHERE (LOWER(name) LIKE '%f%' OR LOWER(venue) LIKE '%f%' OR CAST(date AS TEXT) LIKE '%f%') ORDER BY "events"."created_at" DESC
SELECT "events".* FROM "events" WHERE (LOWER(name) LIKE '%book%') ORDER BY "events"."created_at" DESC LIMIT 6
SELECT "events".* FROM "events" ORDER BY "events"."created_at" DESC LIMIT 6

      scope = Event.order(created_at: :desc)
---
SELECT "events".* FROM "events" WHERE (LOWER(name) LIKE '%f%' OR LOWER(venue) LIKE '%f%' OR CAST(date AS TEXT) LIKE '%f%') ORDER BY "events"."created_at" DESC

  def show
    # Public detail: use external API
    begin
      api = EventsApi.new
      data = api.get_event(params[:id])
      @event = ApiEventMapper.from_hash(data)
    rescue => e
      # Fallback to local DB record if present
      begin
        record = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = 910 LIMIT 1

  def admin_dashboard
    @events = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "date", "venue", "price", "tickets_available", "created_at", "updated_at", "image_url") VALUES ('rugby buss ', '2025-10-23', 'Loftus', 50.0, 300, '2025-09-03 07:07:31.391063', '2025-09-03 07:07:31.391063', NULL) RETURNING "id"

  def update
    if @event.update(event_params)
---
UPDATE "events" SET "price" = 15.3, "tickets_available" = 1, "updated_at" = '2025-09-01 08:49:17.630671' WHERE "events"."id" = 4