app/controllers/events_controller.rb

  def all
    @events = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "date", "venue", "price", "tickets_available", "created_at", "updated_at", "image_url") VALUES ('Match Games', '2025-10-15', 'Loftus', 50.0, 200, '2025-09-03 10:35:43.377916', '2025-09-03 10:35:43.377916', NULL) RETURNING "id"

  def update
    if @event.update(event_params)
---
UPDATE "events" SET "updated_at" = '2025-09-03 10:35:43.546596' WHERE "events"."id" = 22