app/controllers/purchases_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
UPDATE "events" SET "tickets_available" = 197, "updated_at" = '2025-08-29 11:16:24.231499' WHERE "events"."id" = 1
---
  def create
    event = Event.find(params[:event_id])
    quantity = params[:quantity].to_i
    if event.tickets_available >= quantity
      event.tickets_available -= quantity
      event.save