app/controllers/tickets_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" IN (163, 1027, 1029, 19)
SELECT "purchases".* FROM "purchases" WHERE "purchases"."user_id" = 1 ORDER BY "purchases"."purchased_at" DESC LIMIT 5
---
  def download
    explicit_ids = Array(params[:purchase_ids]).map(&:to_i).reject(&:zero?)
    recent_ids = Array(session[:recent_purchase_ids]).map(&:to_i).reject(&:zero?)
    target_ids = if explicit_ids.present?
                   explicit_ids
                 elsif recent_ids.present?
                   recent_ids
                 else
                   []
                 end

    @purchases = if target_ids.present?
                   current_user.purchases.includes(:event).where(id: target_ids)
                 else
                   current_user.purchases.includes(:event).order(purchased_at: :desc).limit(5)

SELECT "purchases".* FROM "purchases" WHERE "purchases"."user_id" = 1 ORDER BY "purchases"."purchased_at" DESC LIMIT 5
---
  def send_email
    explicit_ids = Array(params[:purchase_ids]).map(&:to_i).reject(&:zero?)
    recent_ids = Array(session[:recent_purchase_ids]).map(&:to_i).reject(&:zero?)
    target_ids = explicit_ids.presence || recent_ids.presence
    purchases = if target_ids.present?
                  current_user.purchases.where(id: target_ids)
                else
                  current_user.purchases.order(purchased_at: :desc).limit(5)
                end
    if purchases.blank?