app/controllers/tickets_controller.rb

  def download
    @purchases = current_user.purchases.order(purchased_at: :desc).limit(5)
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."user_id" = 1 ORDER BY "purchases"."purchased_at" DESC LIMIT 5