app/jobs/ticket_email_job.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def perform(user_id, purchase_ids = nil, recipient_email = nil)
    user = User.find_by(id: user_id)